[
  {
    "firstYear": 2018,
    "lastYear": 2021,

    "title": "Professional IT Technician",
    "place": "ESMC",
    "link": "https://www.esmcastilho.pt",

    "cover": "Agueda.jpg",

    "text": "Picture this: a classroom full of thrilled teens, all eager to see their first **‘Hello World’** program come to life. There we were staring at our computers as our simple C programs refused to run.\nMy journey started with a small setback but ignited a **passion** and **curiosity** for software and coding that has been growing ever since.\nDuring high school, I studied all the **fundamentals of Computer Science**, covering everything from pseudocode and databases to hardware and binary systems.\nThis solid foundation was crucial in setting me up for further opportunities, including an internship at [Critec](https://www.critec.pt/inicio) and later pursuing a **bachelor’s degree** in the field.",
    "references": [],

    "gallery": []
  },

  {
    "firstYear": 2021,
    "lastYear": null,

    "title": "Intern in Web Development",
    "place": "Critec",
    "link": "critec.pt/inicio",

    "cover": "Critec.jpg",

    "text": "Beginning my internship in web development was like jumping into the deep end of a pool. I gained hands-on experience coding the foundational elements of websites, from building the base structure to updating and adding new pages on live websites. I also learned to use **new tools** such as [Bootstrap](https://getbootstrap.com) for responsive design and the [BO3-BOzon](https://github.com/One-Shift/BO3-BOzon) back office system for content management.\nCollaborating with a talented team, I tackled **real coding challenges** and contributed to the development and maintenance of functional websites, which helped me improve not only my technical skills but also my **interpersonal** and **collaborative abilities**.",
    "references": [
      { "title": "Metalcértima", "link": "https://www.metalcertima.pt/inicio" },
      { "title": "Nkfitting", "link": "https://www.nkfitting.pt/inicio" }
    ],

    "gallery": []
  },

  {
    "firstYear": 2024,
    "lastYear": null,

    "title": "Volunteering",
    "place": "Viagem Medieval",
    "link": "https://www.viagemmedieval.com",

    "cover": "smf.png",

    "text": "Volunteering at the Viagem Medieval em Terras de Santa Maria da Feira was a truly immersive experience almost like stepping into a living history book. I worked with a team to manage a section featuring a theatrical performance by the company [Mercador de Fábulas](https://mercadorfabulas.wordpress.com). My role involved assisting visitors, providing information, and ensuring a smooth experience for everyone on site. This opportunity was not only a delight but also a fantastic growth experience. I developed **strong interpersonal skills** through interactions with people from various backgrounds and formed lasting friendships with my fellow volunteers.",
    "references": [
      { "title": "Mercador de Fábulas", "link": "https://mercadorfabulas.wordpress.com" }
    ],

    "gallery": []

  },

  {
    "firstYear": 2021,
    "lastYear": null,

    "title": "Bachelor in Computer Science",
    "place": "ISEC",
    "link": "https://www.isec.pt",

    "cover": "Coimbra.jpg",

    "text": "Acquiring a Bachelor’s in Computer Science was a natural step in my journey. It **reinforced the basics** I had learned and took my understanding of the field to new heights.\nI specialized in [Application Development](https://www.ipc.pt/oferta-formativa/licenciatura-em-engenharia-informatica-2/), where I dove into the world of app creation - from doodling initial designs on napkins to coding them into reality. I gained **profound knowledge** and sharpened my skills in areas I was passionate about.It turned out to be one of the **greatest adventures of my life**, filled with significant personal growth, new friendships, and life-changing moments.\nAdapting to the vibrant lifestyle and rich traditions of a city like **Coimbra** brought about substantial change, both academically and personally.",
    "references": [
      { "title": "SOBay", "link": "https://github.com/brunopinto22/SOBay" },
      { "title": "HomeSim", "link": "https://github.com/brunopinto22/HomeSim" }
    ],

    "gallery": [
      "coimbra_7.jpg",
      "coimbra_1.jpg",
      "coimbra_2.jpg",
      "coimbra_6.jpg",
      "Coimbra.jpg",
      "coimbra_5.jpg",
      "coimbra_8.jpg"
    ]

  }
]